# Custom Formulas
tap "reynico/homebrew-tools"

# Text editors, compilers, IDEs and tools
brew "vim"
cask "visual-studio-code"
cask "postman"
brew "go"

# Containers & Kubernetes
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "helm"
brew "osprey"

# Command line tools
brew "jq"
brew "curl"
brew "awscli"
cask "iterm2"
brew "p7zip"
brew "gzip"
brew "python3"
brew "gnu-sed"

# Networking
cask "viscosity"
brew "nmap"
brew "tcpdump"
cask "wireshark"

# Social
cask "slack"
